{
    "mobility": {
        "function": [
            "When the given conversation history is: \"C: Do you often go up and down stairs at home, Mrs. Richards? P: Yes, I do. I usually go up to my bedroom on the second floor.\",\n                        the following up questions on monitoring function level can be: \"c: did you manage to walk the stairs today mrs Richards? P: yes I did, but in the morning my leg was hurting so it took some time to get done c: okay, did it get better during the day to walk the stairs p: yes in the afternoon it felt better.\"\n                        ",
            "When the given conversation history is: \"C: How are you feeling today, Ms. Thompson? P: I'm feeling pretty good, thank you. C: Did you enjoy your daily walk with your walker? P: Yes, it was nice to get some fresh air and stretch my legs.\",\n                       the following up questions on monitoring function level can be: \"c: did you use your walker when going to the park today mrs C? p: yes I went with my walker, because the path was a bit slippery due to the rain c:can walk as far as you want using the walker in the park. p: the walker enables me to walk as I want want with less energy.\"\n                       "
        ],
        "emotion": [
            "When the given conversation history is: \"C: How are you feeling today? Have you been comfortable moving and changing body positions? P: Yes, I feel alright today. I use a chair with some extra cushions to help me get up easier.\",\n                       the following up questions on emotional feedback can be: \"c: how do you feel about needing help to move around in your bed? P: at first I was bothered about it, but now it's fine. c: why were you bothered about it? P: I did not want to concern my husband in helping me turning in bed, but after he said he is happy to help me turning I don't feel upset about it anymore. c: okay, that's great. that also means that you husband is still phyically fit? P: yes he is actually and that gives me a reassuring feeling about being able to live at home with his support.\"\n                       ",
            "When the given conversation history is: \"c: have you been able to get up from the couch last night? P: I am afraid I needed some assistance getting up from the couch last night. c: ah, that is not very nice than. How come you were not able to get up yourself? p: I fell asleep looking at the TV and when I wanted to go to the toilet I notice my back hurt and I could not get up by myself. c: and then what happened? p: I called for my husband who was in the other room and he supported my getting of the couch.\",\n                    the following up questions on emotional feedback can be: \"c: how did you feel about not being able to get up from the couch? P: I felt stupid, because I know falling asleep in front of the TV often makes my back hurt. c: have you already thought of a sollution for that? p: I have been thinking in using pillows to support my back, but I keep foretting them. c: maybe talk about it with your husband then. if this prevents you from getting a sore back, you don't have to worry about asking for help getting up. p: that is a good idea!\"\n                    "
        ]
    },
    "self-care": {
        "function": [
            "When the given conversation history is: \"C: Good morning! How did dressing go for you this morning?\n\nP: Oh, it took a bit longer than usual today, but I managed to get my favorite outfit on.\n\",\n                        the following up questions on monitoring function level can be: \"C: Oh, so you managed it without help?\n\nP: Yes, I did\n\nC: Why did it take more time than usual?\n\nP: Because I wanted to wear a blouse with buttons\n\nC: What's tricky about that?\n\nP: I have trouble getting the buttons to close.\"\n                        ",
            "When the given conversation history is: \"C: How have you been feeling today?\n\nP: I've been doing well, thank you for asking.\n\nC: Have you been keeping track of your meals and exercise routine?\n\nP: Yes, I've been making sure to have my fruits and vegetables and go for a short walk each day.\n\n\",\n                       the following up questions on monitoring function level can be: \"c: Oh, that's very good of you! Do you do any other things for your health?\n\np: Yes, I make sure I have enough relaxation during the day\n\nc: How do you relax best?\n\np: I prefer to lie down for half an hour with meditation music on\n\nc: it sounds like you are very conscious of your health?\n\np: Yes, I find it very important.\"\n                       "
        ],
        "emotion": [
            "When the given conversation history is: \"C: Good morning! How did dressing go for you this morning?\n\nP: Oh, it took a bit longer than usual today, but I managed to get my favorite outfit on.\",\n                          the following up questions on emotional feedback can be: \"c: How do you feel about that not working well anymore?\n\np: I find it difficult, but it's part of age. Fine motor skills are not what they used to be.\n\nc: So it doesn't really bother you?\n\np: no, I just take more time for it, and don't wear a blouse with buttons every day.\"\n                            ",
            "When the given conversation history is: \"C: How have you been feeling today?\n\nP: I've been doing well, thank you for asking.\n\nC: Have you been keeping track of your meals and exercise routine?\n\nP: Yes, I've been making sure to have my fruits and vegetables and go for a short walk each day.\n\n\",\n                            the following up questions on emotional feedback can be: \"C:Is it important for you to take good care of yourself?\n\np: Yes, it makes me feel good.\"\n                            "
        ]
    },
    "communication": {
        "function": [
            "When the given conversation history is: \"C: Good morning! How are you feeling today?\n\nP: Good morning. I'm feeling pretty good, thank you for asking.\n\nC: I noticed you've been practicing formal sign language a lot lately. Are you enjoying the process?\n\nP: Yes, I've been enjoying learning and communicating through sign language. It's challenging but rewarding.\n\nC: That's great to hear. Is there a particular part of sign language that you find most interesting?\n\nP: I find expressing emotions through sign language particularly fascinating. It adds depth to my conversations\n\",\n                        the following up questions on monitoring function level can be: \"C: How long do you practice on average?\n\nP: I practice on average 30 minutes per day?\n\nC: Do you also have conversations with people in sign language?\n\nP: Yes I do,I can have a short conversation in sign language with others\n\nC: That is great, how long have you been learning sign language now?\n\nP: I have started 1 year ago.\"\n                        ",
            "When the given conversation history is: \"C: How have you been enjoying reading the daily newspaper lately?\n\nP: Oh, I've been spending some time each morning trying to catch up on current events.\n\n\nC: That's great to hear! Is there a particular section you prefer reading first?\n\nP: I always start with the headlines and then usually move on to the opinion pieces.\n\nC: Sounds like a good routine. Have you come across any interesting articles recently?\n\nP: Yes, I read a compelling piece on a local community initiative that caught my attention.\n\",\n                       the following up questions on monitoring function level can be: \"C: It sounds like you are very used to reading the newspaper, nice. Are there also other ways to keep up with the news?\n\nP: Yes, every day I read news items on my computer as well\n\nC; what sources do you use?\n\nP: I read newsletter from various magazine every week that are sent by mail\n\nC: How long does it take you to read the newsletter?\n\nP: On average I read 1 hour a week newsletters\n\nC: What do you prefer, receiving news events through  the newsletters or the newspapers?\n\nP: I prefer to read the newspapers every day.\"\n                       "
        ],
        "emotion": [
            "When the given conversation history is: \"C: Good morning! How are you feeling today?\n\nP: Good morning. I'm feeling pretty good, thank you for asking.\n\nC: I noticed you've been practicing formal sign language a lot lately. Are you enjoying the process?\n\nP: Yes, I've been enjoying learning and communicating through sign language. It's challenging but rewarding.\n\nC: That's great to hear. Is there a particular part of sign language that you find most interesting?\n\nP: I find expressing emotions through sign language particularly fascinating. It adds depth to my conversations\n\",\n                          the following up questions on emotional feedback can be: \"C: You told me you like expressing emotions, can you tell me more about expressing emotions in sign language\n\nP: Off course, for me it is really important that people feel included and through expressing emotions you can really have a meaningful conversation with others\n\nC: How do you feel about learning to communicate with sign language?\n\nP: I feel really proud that I was able to learn it, it was a lot of hard work\n\nC: can you tell me more about the hard work learning sign language?\n\nP: Well, you have to learn the gesture, which are a lot and off course you have to learn to communicate in a new way.\"\n                          ",
            "When the given conversation history is: \"C: How have you been enjoying reading the daily newspaper lately?\n\nP: Oh, I've been spending some time each morning trying to catch up on current events.\n\n\nC: That's great to hear! Is there a particular section you prefer reading first?\n\nP: I always start with the headlines and then usually move on to the opinion pieces.\n\nC: Sounds like a good routine. Have you come across any interesting articles recently?\n\nP: Yes, I read a compelling piece on a local community initiative that caught my attention.\n\",\n                            the following up questions on emotional feedback can be: \"C: It sounds like you really enjoy reading the newspapers. Can you tell me more about what you like about it?\n\nP: I like to be connected to the world around me, it give me a good feeling to know I can still keep up with the news\n\nC: What makes it so important for you?\n\nP: Well, as you get older, your world becomes smaller. In this way I still feel part and I am proud I can still manage to read the newspapers \n\nC: And is it the same for the newsletters?\n\nP: No, I enjoy reading the newsletters because in that way I am still connected to my old profession and I enjoy reading the latest developments in my field\n\"\n                        "
        ]
    }
}